<a href="https://colab.research.google.com/github/Vikas-1093/Data-science/blob/main/loading_data_from_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

**Reading and Writing Data in Text Format**

In [ ]:
df = pd.read_csv('/content/sample_data/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
df1= pd.read_table('/content/sample_data/ex1.csv', sep=',')
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
df2= pd.read_csv('/content/sample_data/ex1.csv', header=None , names=['a', 'b', 'c', 'd', 'message'])
df2

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [ ]:
!cat /content/sample_data/csv-mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [ ]:
df2= pd.read_csv('/content/sample_data/csv-mindex.csv', index_col=['key1','key2'] )
df2

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
list(open('/content/sample_data/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [ ]:
result = pd.read_table('/content/sample_data/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [ ]:
!cat /content/sample_data/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
df4= pd.read_csv('/content/sample_data/ex4.csv', skiprows=[0, 2, 3])
df4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat /content/sample_data/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [ ]:
def5 = pd.read_csv('/content/sample_data/ex5.csv')
def5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
pd.isnull(def5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
def55 = pd.read_csv('/content/sample_data/ex5.csv', na_values=['null'])
def55

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
sentinels = {'a': ['5'],'b':['2'], 'something': ['three']}
def6= pd.read_csv('/content/sample_data/ex5.csv', na_values=sentinels)
def6

  something    a     b     c   d message
0       one  1.0   NaN   3.0   4     NaN
1       two  NaN   6.0   NaN   8   world
2       NaN  9.0  10.0  11.0  12     foo

**Reading Text Files in Pieces**

In [3]:
pd.options.display.max_rows = 10

In [4]:
def66= pd.read_csv('/content/sample_data/ex6.csv')
def66

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [5]:
def66= pd.read_csv('/content/sample_data/ex6.csv' , nrows=5)
def66

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [6]:
chunker = pd.read_csv('/content/sample_data/ex6.csv', chunksize=1000)
chunker

In [7]:
chunker = pd.read_csv('/content/sample_data/ex6.csv', chunksize=1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [8]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

**Writing Data to Text Format**

In [9]:
data = pd.read_csv('/content/sample_data/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [10]:
data.to_csv('/content/sample_data/out.csv')
!cat /content/sample_data/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [11]:
import sys

In [12]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [13]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [14]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [15]:
data1= data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])
data1

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [16]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/content/sample_data/tseries.csv')
!cat /content/sample_data/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

**Working with Delimited Formats**

In [17]:
!cat /content/sample_data/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [18]:
import csv
f = open('/content/sample_data/ex7.csv')

reader = csv.reader(f)

In [19]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [21]:
with open('/content/sample_data/ex7.csv') as f:
    lines = list(csv.reader(f))

In [22]:
header, values = lines[0], lines[1:]

In [23]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

**Binary Data Formats**

In [25]:
frame = pd.read_csv('/content/sample_data/ex1.csv')
frame
frame.to_pickle('/content/sample_data/frame_pickle')

In [26]:
frame1= pd.read_pickle('/content/sample_data/frame_pickle')
frame1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
!rm /content/sample_data/frame_pickle

**Using HDF5 Format**

In [29]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [31]:
store = pd.HDFStore('mydata.h5')

In [32]:
store['obj1'] = frame

In [34]:
store['obj1_col'] = frame['a']

In [35]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [36]:
store['obj1']

           a
0   0.688983
1   0.014170
2   0.740726
3   0.560680
4   0.600035
..       ...
95  0.683719
96  1.104205
97 -0.975766
98  0.890626
99 -0.252168

[100 rows x 1 columns]

In [37]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [69]:
frame.to_hdf('mydata.h5', 'obj3', format='table' )

In [70]:
##pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

ValueError: ignored

In [ ]:
##os.remove('mydata.h5')

**Reading Microsoft Excel Files**

In [41]:
xlsx = pd.ExcelFile('/content/sample_data/ex1.xlsx')

In [42]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [43]:
frame = pd.read_excel('/content/sample_data/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [44]:
writer = pd.ExcelWriter('/content/sample_data/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [45]:
frame.to_excel('/content/sample_data/ex2.xlsx')

In [46]:
!rm /content/sample_data/ex2.xlsx

**Interacting with Web APIs**

In [51]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [49]:
data = resp.json()

In [52]:
data[0]['title']

'REGR: Invalid exclusion of nuisance columns with groupby aggregation'

In [53]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

    number  ... state
0    43380  ...  open
1    43379  ...  open
2    43378  ...  open
3    43376  ...  open
4    43375  ...  open
..     ...  ...   ...
25   43339  ...  open
26   43338  ...  open
27   43337  ...  open
28   43334  ...  open
29   43330  ...  open

[30 rows x 4 columns]

**Interacting with Databases**

In [54]:
import sqlite3

In [55]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [56]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [57]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [58]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [59]:
con.executemany(stmt, data)
con.commit()

In [60]:
cursor = con.execute('select * from test')

In [61]:
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [62]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [63]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [64]:
import sqlalchemy as sqla

In [65]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [66]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [67]:
!rm mydata.sqlite